Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: As you can see, when it completes successfully, it gives you a bunch of statistics about what it accomplished.
cs: Proběhne-li proces úspěšně, podá vám obsáhlou statistiku o tom, co bylo provedeno.

source: As you can tell, Git simply replaces the new command with whatever you alias it to.
cs: Chtělo by se tedy říci, že Git jednoduše nahradí nový příkaz jakýmkoli aliasem, který vytvoříte.

source: As you did in the "An Example Git Enforced Policy" section of Chapter 7, we’ll write this in Ruby, because it’s what I generally work with and it tends to be easy to read.
cs: Stejně jako v podkapitole „Příklad vynucení chování systémem Git“ v kapitole 7 použijeme i tentokrát Ruby, s nímž většinou pracuji a který je srozumitelný.

source: As you edit files, Git sees them as modified, because you’ve changed them since your last commit.
cs: Jakmile začnete soubory upravovat, Git je bude považovat za změněné, protože jste v nich od poslední revize provedli změny.

source: As you go on using Git, you’ll probably use other commands frequently as well; in this case, don’t hesitate to create new aliases.
cs: Budete-li pracovat v systému Git častěji, pravděpodobně budete hojně využívat i jiné příkazy. V takovém případě neváhejte a vytvořte si nové aliasy.

source: As you initially make commits, you’re given a `master` branch that points to the last commit you made.
cs: Při prvním zapisování revizí dostanete hlavní větev, jež bude ukazovat na poslední revizi, kterou jste zapsali.

source: As you just saw, to get data from your remote projects, you can run:
cs: Jak jste právě viděli, data ze vzdálených projektů můžete získat pomocí příkazu:

source: As you learn Git, try to clear your mind of the things you may know about other VCSs, such as Subversion and Perforce; doing so will help you avoid subtle confusion when using the tool.
cs: Při seznámení se systémem Git se pokuste zapomenout na vše, co už možná víte o jiných systémech VCS, např. Subversion nebo Perforce. Vyhnete se tak nežádoucím vlivům, které by vás mohly při používání systému Git mást.

source: As you may remember from Chapter 1, Git doesn’t store data as a series of changesets or deltas, but instead as a series of snapshots.
cs: Jak si možná vzpomínáte z kapitoly 1, Git neukládá data jako sérii změn nebo rozdílů, ale jako sérii snímků.

source: As you may remember, Git is fundamentally a linked list of commit objects that point to a snapshot of content.
cs: Jak si možná vzpomínáte, říkali jsme, že Git je v podstatě seznam odkazů na objekty revizí, které ukazují na určitý snímek obsahu.

source: As you type, a helper pops up, showing you possible username matches.
cs: Během psaní se zobrazuje pomocník, který vám navrhuje možná dokončení uživatelského jména.

source: As you’ll remember, you can create the branch based off your master branch like this:
cs: Jak si vzpomínáte, můžete vytvořit větev založenou na své hlavní větvi:

source: As you’re working, Git silently records what your HEAD is every time you change it.
cs: Git během vaší práce v tichosti zaznamenává, kde se nachází ukazatel HEAD (pokaždé, když se změní jeho pozice).

source: Assume that you have the rack files in a subdirectory of your project, and you want to switch it to a submodule.
cs: Řekněme, že máte soubory rack v podadresáři svého projektu a chcete ho přepnout do submodulu.

source: Assuming she already has her repository cloned, she decides to work on `featureA` first.
cs: Protože už má naklonovaný repozitář, rozhodne se pracovat nejprve na úkolu A – `featureA`.

source: Assuming this happens, how can you get your commits back?
cs: Pokud se už něco takového stane, jak dostanete své revize zpět?

source: Assuming you saved the patch at `/tmp/patch-ruby-client.patch`, you can apply the patch like this:
cs: Předpokládejme, že jste záplatu uložili jako `/tmp/patch-ruby-client.patch`. Aplikaci pak provedete takto:

source: At any stage, you may want to undo something.
cs: Kdykoli se může stát, že byste nějakou úpravu chtěli vrátit do původního stavu..

source: At some point in your Git journey, you may accidentally lose a commit.
cs: Někdy se může stát, že nedopatřením přijdete o revizi Git.

source: At some point, you may want to convert your existing project to Git.
cs: V určitém okamžiku možná budete chtít přepnout svůj existující projekt do systému Git.

source: At that point, anyone who can access the web server under which you put the repository can also clone your repository.
cs: Tím je nastavení hotové. V tuto chvíli může každý, kdo má přístup na webový server, kam jste repozitář uložili, tento repozitář naklonovat.

source: At that point, everyone will be able to access that machine via the 'git' user.
cs: Nyní budou mít všichni přístup k tomuto počítači prostřednictvím uživatele 'git'.

source: At the bottom of the instructions page is a link to a Subversion import.
cs: Dole na stránce s instrukcemi najdete odkaz na import ze systému Subversion.

source: At the bottom, you should find a line that looks something like this:
cs: Dole byste měli najít řádek, který vypadá asi takto:

source: At the end of this chapter you should understand why Git is around, why you should use it and you should be all set up to do so.
cs: Na konci kapitoly byste měli rozumět tomu, proč tady Git je, proč byste jej měli používat a měli byste si jej umět nastavit podle svých potřeb.

source: At the end of this list, it writes "done" to initiate the `upload-pack` process to begin sending the packfile of the data it needs:
cs: Výpis je ukončen výrazem „done“, který iniciuje odeslání požadovaného balíčkového souboru nebo dat procesem `upload-pack`:

source: At the very least, this may be a way to get up and running with Git and try it out quickly.
cs: V neposlední řadě může být toto způsob, jak rychle zprovoznit a vyzkoušet systém Git.

source: At this point you might be wondering how the access control rules are actually applied, so let’s go over that briefly.
cs: Teď by vás mohlo zajímat, jak jsou vlastně pravidla pro přístup aplikována, pojďme se na to tedy krátce podívat.

source: At this point, John’s local repository looks something like Figure 5-4.
cs: V tomto okamžiku vypadá Johnův lokální repozitář jako na obrázku 5-4.

source: At this point, nothing in your project is tracked yet.
cs: V tomto okamžiku se z vašeho projektu ještě nic nesleduje.

source: At this point, other users who have SSH access to the same server which has read-access to the `/opt/git` directory can clone your repository by running
cs: V tomto okamžiku mohou všichni ostatní, kdo mají SSH přístup k tomuto serveru s oprávněním pro čtení k adresáři `/opt/git`, naklonovat váš repozitář příkazem:

source: At this point, she needs to share her work with John, so she pushes her `featureA` branch commits up to the server.
cs: V tomto okamžiku potřebuje sdílet svou práci s Johnem, a tak odešle revize své větve `featureA` na server.

source: At this point, suppose you remember one little change that you want to make in `benchmarks.rb` before you commit it.
cs: Nyní předpokládejme, že jste si vzpomněli na jednu malou změnu, kterou chcete ještě před zapsáním revize provést v souboru `benchmarks.rb`.

source: At this point, the `fetch-pack` process looks at what objects it has and responds with the objects that it needs by sending "want" and then the SHA it wants.
cs: V tomto okamžiku proces `fetch-pack` zjistí, jaké objekty má, a vytvoří odpověď s objekty, které potřebuje. Odpověď má tvar „want“ (chci) a SHA požadovaných objektů.

source: At this point, the others can clone it down and push changes back up just as easily:
cs: Ostatní nyní mohou velmi snadno repozitář naklonovat i do něj odesílat změny:

source: At this point, the topics are evaluated to determine whether they’re safe and ready for consumption or whether they need more work.
cs: Nyní budou tematické větve vyhodnoceny, zda jsou bezpečné a mohou být aplikovány, nebo zda potřebují další úpravy.

source: At this point, you can determine what you’d like to do with it.
cs: V tomto okamžiku můžete určit, jak s ní chcete naložit.

source: At this point, you can do all the basic local Git operations — creating or cloning a repository, making changes, staging and committing those changes, and viewing the history of all the changes the repository has been through.
cs: V tomto okamžiku už tedy umíte v systému Git provádět všechny základní lokální operace: vytvářet a klonovat repozitáře, provádět změny, připravit je k zapsání i zapisovat nebo třeba zobrazit historii všech změn, které prošly repozitářem.

source: At this point, you can easily switch branches and do work elsewhere; your changes are stored on your stack.
cs: Nyní můžete bez obav přepnout větve a pracovat na jiném úkolu, vaše změny byly uloženy do zásobníku.

source: At this point, you can exit the interactive adding script and run `git commit` to commit the partially staged files.
cs: V tomto okamžiku můžete ukončit skript interaktivního přidávání a spustit příkaz `git commit`, jímž zapíšete částečně připravené soubory.

source: At this point, you can go back to the master branch and do a fast-forward merge (see Figure 3-30).
cs: Nyní můžete přejít zpět na hlavní větev a provést sloučení „rychle vpřed“ (viz obrázek 3-30).

source: At this point, you can run your test to see if the issue exists as of this commit.
cs: Nyní můžete provést testování a vyzkoušet, zda problém existuje i v této revizi.

source: At this point, you have 11 objects — 4 blobs, 3 trees, 3 commits, and 1 tag:
cs: V současné chvíli máte 11 objektů: 4 bloby, 3 stromy, 3 revize a 1 značku.

source: At this point, you have a Git repository with tracked files and an initial commit.
cs: V této chvíli máte vytvořen repozitář Git se sledovanými soubory a úvodní revizí.

source: At this point, you have to merge this work in again, even though you’ve already done so.
cs: V tuto chvíli vám nezbývá, než změny znovu začlenit do své práce, ačkoli už jste je jednou začlenili.

source: At this point, you may want to turn to a widely used software project called Gitosis.
cs: Proto možná rádi přejdete na rozšířený softwarový projekt „Gitosis“.

source: At this point, you should be able to do most of the day-to-day tasks for which you’ll be using Git.
cs: V této chvíli byste už měli zvládat většinu každodenních úkonů, pro něž se vyplatí Git používat.

source: At this point, you should be able to do most of the things in Git that you’ll need on the command line day to day and feel comfortable doing so.
cs: V této chvíli byste měli v systému Git zvládat většinu úkonů, které se běžně používají na příkazovém řádku, a neměly by vám činit větší potíže.

source: At this point, you should be able to go to your Drafts folder, change the To field to the mailing list you’re sending the patch to, possibly CC the maintainer or person responsible for that section, and send it off.
cs: V tomto okamžiku byste měli být schopni přejít do složky Drafts, změnit pole To na mailing list, do kterého záplatu posíláte, případně pole CC na správce nebo na osobu zodpovědnou za tuto část, a odeslat.

source: At this point, you should be able to visit `http://gitserver/` to view your repositories online, and you can use `http://git.gitserver` to clone and fetch your repositories over HTTP.
cs: V tomto okamžiku byste měli být schopni prohlížet své repozitáře online na adrese `http://gitserver/` a používat `http://git.gitserver` ke klonování a vyzvedávání repozitářů prostřednictvím protokolu HTTP.

source: At this point, you should have a valid Git repository that has imported your branches and tags:
cs: V tomto okamžiku byste tedy měli mít platný repozitář Git s importovanými větvemi a značkami:

source: At this point, your project working directory is exactly the way it was before you started working on issue #53, and you can concentrate on your hotfix.
cs: V tomto okamžiku vypadá váš pracovní adresář přesně tak, jak vypadal, než jste začali pracovat na chybě č. 53, a vy se nyní můžete soustředit na rychlou opravu.

source: At this point, you’re ready to start the walking process.
cs: V tomto okamžiku je vše připraveno a můžete zahájit proces procházení.

source: At this stage, you’ll receive a call that another issue is critical and you need a hotfix.
cs: V tomto okamžiku vám zavolají, že se vyskytla jiná kritická chyba, která vyžaduje rychlou opravu (hotfix).

source: BFG cannot do as much as `filter-branch`, but it is _very_ fast and on a large repository this can make a big difference.
cs: BFG neumí tolik věcí jako `filter-branch`, ale je _velmi_ rychlý. Pro velké repozitáře to může být zásadní rozdíl.

source: Basic sequence of this managed-team workflow.
cs: Základní posloupnost kroků u pracovního postupu v řízeném týmu

source: Basically, all you have to do is put the bare Git repository under your HTTP document root and set up a specific `post-update` hook, and you’re done (See Chapter 7 for details on Git hooks).
cs: Jediné, co většinou stačí udělat, je umístit holý repozitář Git do kořenového adresáře HTTP a nastavit příslušný zásuvný modul `post-update` (zásuvné moduly Git viz kapitola 7).

source: Basically, you need to run this command in a daemonized manner:
cs: V podstatě je třeba spustit tento příkaz:

source: Be careful, because you can’t always revert some of these undos.
cs: Ale buďte opatrní! Ne všechny zrušené změny se dají vrátit.

source: Be warned: this technique is destructive to your commit history.
cs: Ale upozorňuji, že tento postup porušuje historii vašich revizí.

source: Because 'scott' is the only user in the system right now, you’ll add him as the only member, and you’ll create a new project called `iphone_project` to start on:
cs: Protože je v tuto chvíli jediným uživatelem v systému 'scott', přidáte ho jako jediného člena a vytvoříte pro něj nový projekt s názvem `iphone_project`:

source: Because Git allows you to have multiple remote repositories, it’s possible to have a workflow where each developer has write access to their own public repository and read access to everyone else’s.
cs: Protože Git umožňuje, abyste měli několik vzdálených repozitářů, lze použít pracovní postup, kdy má každý vývojář oprávnění k zápisu do vlastního veřejného repozitáře a oprávnění pro čtení k repozitářům všech ostatních.

source: Because Git doesn’t have monotonically increasing numbers like 'v123' or the equivalent to go with each commit, if you want to have a human-readable name to go with a commit, you can run `git describe` on that commit.
cs: Git nepoužívá pro jednotlivé revize monotónně rostoucí čísla („v123“ apod.), a proto možná rádi využijete příkaz `git describe`, jímž lze každé revizi přiřadit běžně zpracovatelný název.

source: Because Git is designed to work with nearly any type of project, these tools are pretty generic, but they can often help you hunt for a bug or culprit when things go wrong.
cs: Protože je Git navržen tak, aby pracoval téměř s jakýmkoli typem projektu, jsou tyto nástroje velmi univerzální. Často vám mohou pomoci odhalit vzniklou chybu nebo problém.

source: Because Git is very flexible, people can and do work together many ways, and it’s problematic to describe how you should contribute to a project — every project is a bit different.
cs: Vzhledem k velké flexibilitě systému Git mohou uživatelé spolupracovat mnoha různými způsoby, a není proto snadné popsat, jak byste měli do projektu přispívat. Každý projekt je trochu jiný.

source: Because Git uses a simple three-way merge, merging from one branch into another multiple times over a long period is generally easy to do.
cs: Vzhledem k tomu, že Git používá jednoduché třícestné slučování, je velmi snadné začleňovat jednu větev do druhé i několikrát v rámci dlouhého časového intervalu.

source: Because a branch in Git is in actuality a simple file that contains the 40 character SHA-1 checksum of the commit it points to, branches are cheap to create and destroy.
cs: Vzhledem k tomu, že větev v systému Git tvoří jeden jednoduchý soubor, obsahující 40 znaků kontrolního součtu SHA-1 revize, na niž ukazuje, je snadné větve vytvářet i odstraňovat.

source: Because commits contain the SHA-1 values of their parents, this command changes every commit SHA in your history, not just those that have the matching e-mail address.
cs: Protože revize obsahují hodnoty SHA-1 svých rodičů, změní tento příkaz SHA všech revizí ve vaší historii, ne pouze těch, které mají odpovídající e-mailovou adresu.

source: Because hooks aren’t transferred with a clone of a project, you must distribute these scripts some other way and then have your users copy them to their `.git/hooks` directory and make them executable.
cs: Jelikož se zásuvné moduly při naklonování projektu nekopírují, musíte tyto skripty distribuovat jinak a uživatelům zadat instrukce, aby je zkopírovali do svého adresáře `.git/hooks` a zajistili, že budou spustitelné.

source: Because it contains work that isn’t merged in yet, trying to delete it with `git branch -d` will fail:
cs: Jelikož obsahuje práci, která ještě nebyla začleněna, bude pokus o její smazání příkazem `git branch -d` neúspěšný:

source: Because it generally uses a static HTTP server to serve all the data, a normal Apache server can serve thousands of files per second on average — it’s difficult to overload even a small server.
cs: Vzhledem k tomu, že k obsluze všech dat používá většinou statický HTTP server, obslouží běžný server Apache průměrně několik tisíc souborů za sekundu. Ani malý server proto není snadné přetížit.

source: Because it’s not as intelligent about transferring only the data you need — there is no dynamic work on the part of the server in these transactions — the HTTP protocol is often referred to as a _dumb_ protocol.
cs: Protože protokol není natolik inteligentní, aby přenášel pouze data, která potřebujete – v těchto transakcích se na straně serveru nesetkáte s dynamickou činností – je protokol HTTP často nazýván _dumb protocol_ (hloupý protokol).

source: Because it’s rarely used, we won’t cover it in this book.
cs: Protože se tato možnost využívá zřídka, nebudeme se jí v této knize věnovat.

source: Because that server has a subset of the data your `origin` server has right now, Git fetches no data but sets a remote branch called `teamone/master` to point to the commit that `teamone` has as its `master` branch (see Figure 3-26).
cs: Protože je tento server podmnožinou dat, která jsou právě na serveru `origin`, Git nevyzvedne žádná data, ale nastaví vzdálenou větev nazvanou `teamone/master` tak, aby ukazovala na revizi, kterou má server `teamone` nastavenou jako větev `master` (viz obrázek 3-26).

source: Because the commit on the branch you’re on isn’t a direct ancestor of the branch you’re merging in, Git has to do some work.
cs: Vzhledem k tomu, že revize na větvi, na níž se nacházíte, není přímým předkem větve, kterou chcete začlenit, Git bude muset podniknout určité kroky.

source: Because the commit pointed to by the branch you merged in was directly upstream of the commit you’re on, Git moves the pointer forward.
cs: Jelikož revize, na niž ukazovala větev, do níž jste začleňovali, byla v přímým předchůdcem revize, na níž jste se nacházeli, Git přesunul ukazatel vpřed.

source: Because the date is expressed in the name of the directory, you’ll parse it out.
cs: Protože je datum obsaženo v názvu adresáře, lze ho vyčíst odtud.

source: Because the reflog data is kept in the `.git/logs/` directory, you effectively have no reflog.
cs: Protože se data pro reflog uchovávají v adresáři `.git/logs/`, nemáte evidentně žádný reflog.

source: Because the refspec is `<src>:<dst>`, by leaving off the `<src>` part, this basically says to make the topic branch on the remote nothing, which deletes it.
cs: Vynecháte-li z původního vzorce refspec ve tvaru `<src>:<dst>` část `<src>`, říkáte v podstatě, aby byla větev „topic“ na vzdáleném serveru nahrazena ničím, čímž ji smažete.

source: Because the repository is only used as a collaboration point, there is no reason to have a snapshot checked out on disk; it’s just the Git data.
cs: Protože se repozitář používá pouze jako místo pro spolupráci, není žádný důvod, aby byl na disku načten konkrétní snímek. Jsou tu pouze uložena data systému Git.

source: Because the server will tell you that you can’t push a non-fast-forward anyway, and the hook prevents forced pushes, the only accidental thing you can try to catch is rebasing commits that have already been pushed.
cs: Vzhledem k tomu, že vám server sdělí, že nelze odesílat revize nesměřující rychle vpřed, a zásuvný modul neumožní odeslat revize nesplňující dané požadavky, je vaší poslední možností přeskládat revize, které jste již odeslali.

source: Because the server-side method looks at the log of commits, and, at this point, the commit hasn’t been recorded yet, you must get your file listing from the staging area instead.
cs: Protože serverová metoda využívá záznam revizí, ale ve vašem případě ještě nebyla revize zaznamenána, musí být seznam souborů pořízen na základě oblasti připravených změn.

source: Because this is so common, you can replace this entire part with `-s`, which means standard layout and implies all those options.
cs: Protože se jedná o častou situaci, můžete celou tuto část nahradit parametrem `-s`, který označuje standardní layout a implikuje všechny uvedené parametry.

source: Because we can’t cover all of them, and because I happen to work at one of them, we’ll use this section to walk through setting up an account and creating a new project at GitHub.
cs: Protože se tu nemůžeme věnovat všem možnostem a protože shodou okolností na jednom hostingovém místě pracuji, využijeme tuto část k tomu, abychom ukázali nastavení účtu a vytvoření nového projektu na serveru GitHub.

source: Because you already merged in `iss53` earlier, you see it in your list.
cs: Jelikož už jste větev `iss53` začlenili, nyní se zobrazí ve výpisu.

source: Because you don’t download the whole history in those systems, this type of addition carries few consequences.
cs: Protože v těchto systémech nestahujete celou historii, nebývá s vkládáním velkých souborů problém.

source: Because you don’t have the permissions to directly update branches on the project, you have to get the work to the maintainers some other way.
cs: Protože nemáte oprávnění aktualizovat větve projektu přímo, musíte svou práci doručit správcům jinak.

source: Because you have the entire history of the project right there on your local disk, most operations seem almost instantaneous.
cs: Protože máte celou historii projektu uloženou přímo na svém lokálním disku, probíhá většina operací takřka okamžitě.

source: Because you need to use the same format to specify the file contents later, you create a helper method, `export_data`:
cs: Protože budete stejný formát potřebovat i později, k určení obsahu souboru vytvoříte pomocnou metodu – `export_data`:

source: Because you never added them to any commits, they’re considered dangling and aren’t packed up in your new packfile.
cs: Jelikož jste je nikdy nevložili do žádné z revizí, Git je považuje za volné a nezabalil je do nového balíčkového souboru.

source: Because you only want the `old-file` and `new-file` arguments, you use the wrapper script to pass the ones you need.
cs: Protože chcete pouze parametry `old-file` a `new-file`, použijete wrapperový skript k zadání těch, které potřebujete.

source: Because you rebased the branch, you have to specify the `-f` to your push command in order to be able to replace the `featureA` branch on the server with a commit that isn’t a descendant of it.
cs: Protože jste větev přeskládali, musíte k příkazu git push přidat parametr `-f`, abyste mohli větev `featureA` na serveru nahradit revizí, která není jejím potomkem.
